clear
% 汽车动力性计算
%----------------------------------------------------------------------------
% 图1发动机功率外特性和转矩外特性曲线
% 参数


% 转速，单位r/min
n = [];
%车轮半径，单位m

% 发动机转矩曲线四次多项式的系数矩阵 a4,a3,a2,a1,a0
a = [-3.85445e-12,40.874e-9,-165.44e-6,0.29527,-19.313];
% 发动机转矩
T_tq = [];
% 功率
P_e = [];


%驱动力行驶阻力平衡图
%车轮半径 m    %轴距     %质心至前轴距离(满载)   质心高（满载）
r = 0.367;    L = 3.2;    a1 = 1.947;            h_g = 0.9;
%装载质量 kg    %整车整备质量    %总质量
m1 = 2000;       m2 = 1800;     m3 = 3880;


% 传动系机械效率
yita_T = 0.85;
% 滚动阻力系数
f = 0.013;
%空气阻力系数*迎风面积 m2
C_DA = 2.77;
%主减速器传动比  %变速器传动比
i_0 = 6.33;   
%飞轮转动惯量 kg*m2  %二前轮转动惯量  %四后轮转动惯量
I_f = 0.218;         I_w1 = 1.798;   I_w2 = 3.598;
% 挡位 1档 2档 3档 4档 5档
i_g4 = [6.09,3.09,1.71,1.00];
i_g5 = [5.56,2.769,1.644,1.00,0.793];
%重力

%速度(与转速之间关系为0.377*r*n/i_0/i_g)    % 坡度    %汽车旋转质量换算系数
u_a =[];                                    slope = 0;     delta = 0;

%行驶方程式
F_t = [];
B0=[1326.8 1354.7 1284.4 1122.9 1141.0 1051.2 1233.9 1129.7];
B1=[-416.46 -303.98 -189.75 -121.59 -98.893 -73.714 -84.478 -45.291];
B2=[72.379 36.657 14.524 7.0035 4.4763 2.8593 2.9788 0.71113];
B3=[-5.8629 -2.0553 -0.51184 -0.18517 -0.091077 -0.05138 -0.047449 -0.00075215];
B4=[0.17768 0.043072 0.0068164 0.0018555 0.00068906 0.00035032 0.00028230 -0.000038568];
vector_n = [815,1207,1614,2012,2603,3006,3403,3804];
vector_b =[];
vector_v =[];
Tq =[];
for i=1:5
   for j=1:8
    Tq (j) = polyval(a,vector_n(j));
    Pe(j)=Tq(j)*vector_n(j)/9550;
    vector_v(i,j) = 0.377 * r * vector_n(j) / i_0 / i_g5(i);
    vector_b(j)=B0(j)+B1(j)*Pe(j)+B2(j)*Pe(j)^2+B3(j)*Pe(j)^3+B4(j)*Pe(j)^4;
   end
end
vector_b(:,1) = [];
vector_v(:,1) = [];
% vector_b(:,7) = [];
% vector_v(:,7) = [];
% % vector_b(:,5) = [];
% % vector_v(:,5) = [];
% % vector_b(:,5) = [];
% % vector_v(:,5) = [];
b1=polyfit(vector_v(1,:),vector_b,3);
b2=polyfit(vector_v(2,:),vector_b,3);
b3=polyfit(vector_v(3,:),vector_b,3);
b4=polyfit(vector_v(4,:),vector_b,3);
b5=polyfit(vector_v(5,:),vector_b,3);
ua = [40,50,60];

 p3 = polyfit(vector_v(3,:),vector_b(1,:),3);
 p4 = polyfit(vector_v(4,:),vector_b(1,:),3);

 
 
Pe=[];
for i=1:3
Pe(1,i)= (((ua(1,i) * ua(1,i) * C_DA)/21.15+(m3*9.8*f))*ua(1,i))/(3600*yita_T);
end

 b_(1,:) = polyval(p3,ua);
 b_ (2,:)= polyval(p4,ua);
 
 s = [125,250,250];
 
 for i=1:2
 for j =1:3
    
     Q(i,j) = (Pe(j) * b_(i,j) * s(j))/(102*ua(j)*7.0);
     
 end 
 end

 for v =40:50
     
 delta = 1 + (I_w1+I_w2)/((r*r)*m3) + (I_f*i_0*i_0*i_g5(1,3)*i_g5(1,3)*yita_T)/((r*r)*m3);
 Pe40_50(1,v) = (((m3*9.8*f)*v/3600)+(C_DA*v*v*v)/76140)+((m3*v*delta)*0.20/3600)/yita_T;
 b_3_tmp(1,v)= polyval(p3,v);
 Qt(1,v) =  Pe40_50(1,v)* b_3_tmp(1,v)/(367.1*7);
 
 delta = 1 + (I_w1+I_w2)/((r*r)*m3) + (I_f*i_0*i_0*i_g5(1,4)*i_g5(1,4)*yita_T)/((r*r)*m3);
 Pe40_50(2,v) = (((m3*9.8*f)*v/3600)+(C_DA*v*v*v)/76140)+((m3*v*delta)*0.20/3600)/yita_T;
 b_4_tmp(1,v) = polyval(p4,v);
 Qt(2,v) =  Pe40_50(2,v)* b_4_tmp(1,v)/(367.1*7);
 end

%  b_(3,:) = cumtrapz(b_3_tmp)/16;
 Q(3,1) =trapz(Qt(1,:))*1.38;
  Q(4,1) =trapz(Qt(2,:))*1.38;

 
 for v =50:60
     
  delta = 1 + (I_w1+I_w2)/((r*r)*m3) + (I_f*i_0*i_0*i_g5(1,3)*i_g5(1,3)*yita_T)/((r*r)*m3);
  Pe50_60(1,v) = (((m3*9.8*f)*v/3600)+(C_DA*v*v*v)/76140)+((m3*v*delta)*0.17/3600)/yita_T;
  b_5_tmp(1,v)= polyval(p3,v);
  Qt(3,v) =  Pe50_60(1,v)* b_5_tmp(1,v)/(367.1*7);
  
  delta = 1 + (I_w1+I_w2)/((r*r)*m3) + (I_f*i_0*i_0*i_g5(1,4)*i_g5(1,4)*yita_T)/((r*r)*m3);
  Pe50_60(2,v) = (((m3*9.8*f)*v/3600)+(C_DA*v*v*v)/76140)+((m3*v*delta)*0.17/3600)/yita_T;
  b_6_tmp(1,v)= polyval(p4,v);
  Qt(4,v) =  Pe50_60(2,v)* b_6_tmp(1,v)/(367.1*7);
  

 end
 
 
  Q(3,2) =trapz(Qt(3,:))*1.63;
  Q(4,2) =trapz(Qt(4,:))*1.63;
  
  
 Q3_sum=( Q(1,1)+Q(1,2)+Q(1,3)+Q(3,1)+Q(3,2)+0.299*21.5)*100/1075;
 Q4_sum=( Q(2,1)+Q(2,2)+Q(2,3)+Q(4,1)+Q(4,2)+0.299*21.5)*100/1075;